package go_bahttext

import "testing"

func TestConvertToText(t *testing.T) {
	tests := []struct {
		input    string
		expected string
	}{
		{"7,532.73 บาท", "เจ็ดพันห้าร้อยสามสิบสองบาทเจ็ดสิบสามสตางค์"},
		{"1,000.00 บาท", "หนึ่งพันบาทถ้วน"},
		{"100.25 บาท", "หนึ่งร้อยบาทยี่สิบห้าสตางค์"},
		{"21.10 บาท", "ยี่สิบเอ็ดบาทสิบสตางค์"},
		{"99.99 บาท", "เก้าสิบเก้าบาทเก้าสิบเก้าสตางค์"},
		{"5,555.55 บาท", "ห้าพันห้าร้อยห้าสิบห้าบาทห้าสิบห้าสตางค์"},
		{"0.01 บาท", "ศูนย์บาทหนึ่งสตางค์"},
		{"1.00 บาท", "หนึ่งบาทถ้วน"},
		{"12,345.67 บาท", "หนึ่งหมื่นสองพันสามร้อยสี่สิบห้าบาทหกสิบเจ็ดสตางค์"},
		{"0.00 บาท", "ศูนย์บาทถ้วน"},
		{"0.82 บาท", "ศูนย์บาทแปดสิบสองสตางค์"},
		{"12,345.67 บาท", "หนึ่งหมื่นสองพันสามร้อยสี่สิบห้าบาทหกสิบเจ็ดสตางค์"},
		{"0.00 บาท", "ศูนย์บาทถ้วน"},
		{"7,654.32 บาท", "เจ็ดพันหกร้อยห้าสิบสี่บาทสามสิบสองสตางค์"},
		{"9,999.99 บาท", "เก้าพันเก้าร้อยเก้าสิบเก้าบาทเก้าสิบเก้าสตางค์"},
		{"0.10 บาท", "ศูนย์บาทสิบสตางค์"},
		{"0.11 บาท", "ศูนย์บาทสิบเอ็ดสตางค์"},
		{"10.50 บาท", "สิบบาทห้าสิบสตางค์"},
		{"1,234.00 บาท", "หนึ่งพันสองร้อยสามสิบสี่บาทถ้วน"},
		{"11.11 บาท", "สิบเอ็ดบาทสิบเอ็ดสตางค์"},
		{"5,432.21 บาท", "ห้าพันสี่ร้อยสามสิบสองบาทยี่สิบเอ็ดสตางค์"},
		{"2,222.22 บาท", "สองพันสองร้อยยี่สิบสองบาทยี่สิบสองสตางค์"},
		{"5,555.55 บาท", "ห้าพันห้าร้อยห้าสิบห้าบาทห้าสิบห้าสตางค์"},
	}

	for _, tt := range tests {
		result := ConvertToText(tt.input)
		if result != tt.expected {
			t.Errorf("For input %s, expected %s but got %s", tt.input, tt.expected, result)
		}
	}
}
