package go_bahttext

import (
	"fmt"
	"testing"
)

func haveErr(err error) bool {
	if err != nil {
		return true
	} else {
		return false
	}
}

func TestConvertToText(t *testing.T) {
	tests := []struct {
		input    string
		expected string
		mustErr  bool
	}{
		{"7,532.73 บาท", "เจ็ดพันห้าร้อยสามสิบสองบาทเจ็ดสิบสามสตางค์", false},
		{"1,000.00 บาท", "หนึ่งพันบาทถ้วน", false},
		{"100.25 บาท", "หนึ่งร้อยบาทยี่สิบห้าสตางค์", false},
		{"7532.73", "เจ็ดพันห้าร้อยสามสิบสองบาทเจ็ดสิบสามสตางค์", false},
		{"1000.00", "หนึ่งพันบาทถ้วน", false},
		{"100.25 บาท", "หนึ่งร้อยบาทยี่สิบห้าสตางค์", false},
		{"21.10 บาท", "ยี่สิบเอ็ดบาทสิบสตางค์", false},
		{"99.99 บาท", "เก้าสิบเก้าบาทเก้าสิบเก้าสตางค์", false},
		{"5,555.55 บาท", "ห้าพันห้าร้อยห้าสิบห้าบาทห้าสิบห้าสตางค์", false},
		{"0.01 บาท", "ศูนย์บาทหนึ่งสตางค์", false},
		{"1.00 บาท", "หนึ่งบาทถ้วน", false},
		{"12,345.67 บาท", "หนึ่งหมื่นสองพันสามร้อยสี่สิบห้าบาทหกสิบเจ็ดสตางค์", false},
		{"0.00 บาท", "ศูนย์บาทถ้วน", false},
		{"0.82 บาท", "ศูนย์บาทแปดสิบสองสตางค์", false},
		{"12,345.67 บาท", "หนึ่งหมื่นสองพันสามร้อยสี่สิบห้าบาทหกสิบเจ็ดสตางค์", false},
		{"0.00 บาท", "ศูนย์บาทถ้วน", false},
		{"7,654.32 บาท", "เจ็ดพันหกร้อยห้าสิบสี่บาทสามสิบสองสตางค์", false},
		{"9,999.99 บาท", "เก้าพันเก้าร้อยเก้าสิบเก้าบาทเก้าสิบเก้าสตางค์", false},
		{"0.10 บาท", "ศูนย์บาทสิบสตางค์", false},
		{"0.11 บาท", "ศูนย์บาทสิบเอ็ดสตางค์", false},
		{"10.50 บาท", "สิบบาทห้าสิบสตางค์", false},
		{"1,234.00 บาท", "หนึ่งพันสองร้อยสามสิบสี่บาทถ้วน", false},
		{"11.11 บาท", "สิบเอ็ดบาทสิบเอ็ดสตางค์", false},
		{"5,432.21 บาท", "ห้าพันสี่ร้อยสามสิบสองบาทยี่สิบเอ็ดสตางค์", false},
		{"2,222.22 บาท", "สองพันสองร้อยยี่สิบสองบาทยี่สิบสองสตางค์", false},
		{"5,555.55 บาท", "ห้าพันห้าร้อยห้าสิบห้าบาทห้าสิบห้าสตางค์", false},
		{"12,345,678.55 บาท", "สิบสองล้านสามแสนสี่หมื่นห้าพันหกร้อยเจ็ดสิบแปดบาทห้าสิบห้าสตางค์", false},
		{"456,123,112,345,678.55 บาท", "สี่ร้อยห้าสิบหกล้านหนึ่งแสนสองหมื่นสามพันหนึ่งร้อยสิบสองล้านสามแสนสี่หมื่นห้าพันหกร้อยเจ็ดสิบแปดบาทห้าสิบห้าสตางค์", false},
		{"456123112345678.55", "สี่ร้อยห้าสิบหกล้านหนึ่งแสนสองหมื่นสามพันหนึ่งร้อยสิบสองล้านสามแสนสี่หมื่นห้าพันหกร้อยเจ็ดสิบแปดบาทห้าสิบห้าสตางค์", false},
		{fmt.Sprintf("%f", 12345678.55), "สิบสองล้านสามแสนสี่หมื่นห้าพันหกร้อยเจ็ดสิบแปดบาทห้าสิบห้าสตางค์", false},
		{"10.505 บาท", "", true},
		{"10.50.111 บาท", "", true},
		{"หนึ่ง.12 บาท", "", true},
	}

	for _, tt := range tests {
		result, err := ConvertToText(tt.input)
		if result != tt.expected {
			t.Errorf("For input %s, expected %s but got %s", tt.input, tt.expected, result)
		}
		if haveErr(err) != tt.mustErr {
			t.Errorf("For input %s, expected have errors is %t but got %t", tt.input, tt.mustErr, haveErr(err))
		}
	}
}

func TestConvertFloatToText(t *testing.T) {
	testCases := []struct {
		input    float64
		expected string
		mustErr  bool
	}{
		{7532.73, "เจ็ดพันห้าร้อยสามสิบสองบาทเจ็ดสิบสามสตางค์", false},
		{1000.00, "หนึ่งพันบาทถ้วน", false},
		{100.25, "หนึ่งร้อยบาทยี่สิบห้าสตางค์", false},
		{21.10, "ยี่สิบเอ็ดบาทสิบสตางค์", false},
		{99.99, "เก้าสิบเก้าบาทเก้าสิบเก้าสตางค์", false},
		{5555.55, "ห้าพันห้าร้อยห้าสิบห้าบาทห้าสิบห้าสตางค์", false},
		{0.01, "ศูนย์บาทหนึ่งสตางค์", false},
		{1.00, "หนึ่งบาทถ้วน", false},
		{12345.67, "หนึ่งหมื่นสองพันสามร้อยสี่สิบห้าบาทหกสิบเจ็ดสตางค์", false},
		{0.00, "ศูนย์บาทถ้วน", false},
		{0.82, "ศูนย์บาทแปดสิบสองสตางค์", false},
		{12345.67, "หนึ่งหมื่นสองพันสามร้อยสี่สิบห้าบาทหกสิบเจ็ดสตางค์", false},
		{0.00, "ศูนย์บาทถ้วน", false},
		{7654.32, "เจ็ดพันหกร้อยห้าสิบสี่บาทสามสิบสองสตางค์", false},
		{9999.99, "เก้าพันเก้าร้อยเก้าสิบเก้าบาทเก้าสิบเก้าสตางค์", false},
		{0.10, "ศูนย์บาทสิบสตางค์", false},
		{0.11, "ศูนย์บาทสิบเอ็ดสตางค์", false},
		{10.50, "สิบบาทห้าสิบสตางค์", false},
		{1234.00, "หนึ่งพันสองร้อยสามสิบสี่บาทถ้วน", false},
		{11.11, "สิบเอ็ดบาทสิบเอ็ดสตางค์", false},
		{5432.21, "ห้าพันสี่ร้อยสามสิบสองบาทยี่สิบเอ็ดสตางค์", false},
		{2222.22, "สองพันสองร้อยยี่สิบสองบาทยี่สิบสองสตางค์", false},
		{5555.55, "ห้าพันห้าร้อยห้าสิบห้าบาทห้าสิบห้าสตางค์", false},
		{12345678.55, "สิบสองล้านสามแสนสี่หมื่นห้าพันหกร้อยเจ็ดสิบแปดบาทห้าสิบห้าสตางค์", false},
		{10.505, "", true},
	}

	for _, tt := range testCases {
		result, err := ConvertFloatToText(tt.input)
		if result != tt.expected {
			t.Errorf("For input %f, expected %s but got %s", tt.input, tt.expected, result)
		}
		if haveErr(err) != tt.mustErr {
			t.Errorf("For input %f, expected have errors is %t but got %t", tt.input, tt.mustErr, haveErr(err))
		}

	}
}
